[
  {
    "id": 0,
    "name": " ස්ථූපයේ මුල් සැලැස්ම",
    "caption": " ලයිට් කැපුවහම කරුවලේ ඉන්න එකද කරන්නේ ?",
    "Detail": "වසර දෙකකටත් වැඩිකාලෙකට පසු, මටත් මතක් උනා මට බ්ලොග් එකක් තිබුනා කියලා. නොලියා සිටින්න නම් බොහෝ හේතු ඇත. ලොකුම හේතුව කම්මැලි කම, දෙවන හේතුව Techකාතා,  ලියන්න හිතේ තියන ගොඩක් දේවල් කටින් Techකතා වල කියවෙන නිසා බ්ලොග් එක ලියන්න කම්මැලියි. අනික් හේතුව සියලුම පරිගනක මැක් පරිගන උන නිසා හරියට ටයිප් කරන්න විදියක් නොමැතිවීම. (විජේසේකර යතුරුපුවරුව හුරු නොවීම ලොකු අඩුපාඩුවක්) තවද Techduino වගේ දේවල් නිසාත් කාලය අඩු උනා. ලියනවාට වඩා විඩියෝ හදන එක ලේසියි කිලත් හිතුනා. (නොලියන්න ඕනේ තරම් හේතුනම් ඇත) කොහොම උන්ත බ්ලොග් කියන එක අතහැරලා දාන එක හොදනෑ කියන එක හිතුන නිසා, මේක වත් කියනවා කියලා හිතුවා! කරන කියන දේවල් දැනගන්න ඕනේනම් @kalinga ඔස්සේ හෝ Kalinga G+ දැනගන්න පුලුවන්. විඩියෝ නම් මෙතනින්. මට තියන ලොකුම ගැටලුව, තාම මෙහෙම් බ්ලොග් එකක් තිබුනා කියලා මතක අය ඉන්නවාද කියලා :D    ",
    "poster": "http://asmworks.net/thumbnails/ouer.jpg",
    "video": "video/clip.mp4",
    "voice":"video/voic.mp3",
    "youtube":"20Y6tTQBUF8"
  },
  {
    "id": 1,
    "name": "ස්ථූපයේ වර්ධිත සැලැස්ම",
    "caption": "ලංකාවේ හොදම බැංකුව මොකද්ද ?",
    "Detail": "අද මේ digital media ලෝකේ හරිම අමාරු දෙයක් තමයි මේ digital media manage කරන එක. මොකද මගේ ගාවම mp3, divx mpg, wmv, etc තියනවා 500GB වලට වඩා, කොහොමද මේ ඔක්කොම පාවිච්චි කරන්නේ ? ගොඩක් අය ඉතින් computer එකේ තමයි. ඒත් මටනම් ඒක මහ කරදරයක්… රෑට නිදාගන්න ගමන් සින්දුවක් අගන්න computer එක දාගෙන නිදාගන්න එක මහ අපරාධයක්, ipod නම්, ආයේ තමන් කැමති එක computer එකෙන් ipod copy කර කර ඉන්න එපැයි. ඔය ඔක්කොටම වඩා මට මේවා මගේ home theater එකට දාගන්නත් ඕනේ, මේක ඔය ipod වලින් කරන්න බෑ, අනික මට film වගේ ඒවා 5.1 sound system එකේන්ම බලන්නත් ඕනේ… ඔය ඔක්කොටම පිලිතුරක් මට හම්බ වුණා. ",
    "poster": "image/2.jpg"
  },
  {
    "id": 2,
    "name": "ස්ථූප වර්ග",
    "caption": "බුදුඅම්මෝ… Drone එනවා…",
    "Detail": "අකාලෙට වැහි වගේ බ්ලොග් ලියන මම ඔන්න අද ලියන්න යනේ Audio ගැන උනන්දුවක් දක්වන හා electrons වලට කැමති අයට පොඩි පොස්ට එකක්. ඉස්සෙලා බලමු මොනවද මේ Vacuum Tubes/Valve කියනේ කියලා.  1900 ගනන් වලට මේ Transistor, IC(Integrated Circuits ) එන්න කලින් රේඩියෝ, TV විතරන් නොවෙයි පරිගණක පවා බාවිතා කරේ මේ වැකුම් ටියුබ්. [caption id=attachment_768 align=alignnone width=225 caption=acuum Tube][/caption] ඔය තියෙන්නේ Tube එකක්, මේක හරියට බල්බ් එකක් වගේ, ඒ විතරක් නොවෙයි, මේක ඇතුලේ ෆිලමන්ට් එකක් තියන නිසා මේක ටිකක් කලාමැදිරි එලියට දැල්වෙනවා. (more…)",
    "poster": "image/1.jpg"
  },
  {
    "id": 3,
    "name": "සලපතල මළුව",
    "caption": "ලෙඩ දෙන Motherboard වල Capacitor මාරු කිරීම.",
    "Detail": "කාලෙකින් බ්ලොග් එකක් ලිවුවෙත් නෑ, නමුත් මෙය ලිවිය යුතු කාලය පැමිණ ඇත. දැනට SLT නොහොත Sri Lanka Telecom, නැතිනම් ඔවුගේ මෝඩ වෙළද දැන්වීම අනුව www විසින් ග්‍රහකයන් මුලාකිරීමක් ආරම්බ කර ඇත.  එහම් මුලාකිරීම නම් කිසිදු දැනුම් දීමක් නොමැතිව හෝ අනුමැතියක් TRC වෙනි නොමැතිව (එසේ අනුමැතියක් ඇතිනම් එය සියලුම පාරිබෝහිකයන්ට දැනුම් දිය යුතුයි.) වැඩිපුර download කරන පැරණි Unlimited ADSL  package ඇති අයගේ වේගයන් අඩු කිරීමයි. පැරණි පැකේජ ගන්නා විට කිසිම කෙනෙකුට FUP (Fare User Policy) එකක් හෝ මෙවැනි වේග අඩුකිරීමක් කරන බව කියා නොමැත. මෙය කරන්නේ හොර රහසේය. ඉහත දැක්වෙන්නේ ADSL 4Mbps Unlimited කියන පැකේජයක ලංකාවේ සිට ඇමරිකාවට (NY) ලැබෙන වේගයන්.   කෙනෙකුට කියන්න පුලුවන්, මේක SLT පාලනයෙන් තොර International Bandwidth (ලංකාව හා ඇමරිකාව අතර තියන සම්බ්න්දය) හෝ speediest කරන අඩවියේ ගැටලුවක් කියලා. (more…) ",
    "poster": "image/4.jpg"
  },
  {
    "id": 4,
    "name": "වාහල්කඩ",
    "caption": " වාහනයක cooling system එකක ක්‍රියාකාරිත්වය හා දෝෂ්නිරාකරණය",
    "Detail": "ජංගම දුරකතනය මුල් අවදියේදී යොදාගත්තේ එකිනෙකා අතර කතාබහ කිරීමටයි, නමුත් වසර කීපයකදී මෙය බොහෝසෙයින් වෙනස්ව ඇත. දැන් ජංගම දුරකතන වලින් ඇමතුම් ගන්නවාට වඩා ඒවා යොදාගන්නේ SMS කිරීමට, විඩියෝ/වායාරුප ගැනීමට, චැටි කිරීමට වගේම අන්තර්ජාලයේ සැරිසැරීමටත්. දැන් දුරකතනවල ජාල වල දියුනුව වන්නේ ද මෙමෙ දත්ත සේවා පැත්තෙන්. 2වන පරම්පරාවේ සිට 4වන පරම්පරාවට එනකොට දත්ත සේවාවල විෂාල දියුනුවක් ලැබිලා තියනවා.  GSM data, GPRS, EDGE, 3G (UMTS), HSDPA, HSUPA, HSPA+ වැනි විවිද දත්ත ක්‍රම මගින් අපිට වේගවත් දත්ත ලබාදෙනවා. මේ අතරට අලුතෙන්ම ආපු නම තමයි 4G (LTE - Long Term Evolution) මෙයට හේතුව තමයි මේ වෙනකන් Voice හා දත්ත (data) වෙන වෙනම ජාලයේ පැවතීම. මෙම නිසා 4G වලදී සියල්ල data (දත්ත) මතට ගෙන යෑම තමයි මෙහිදී සිදුවන්නේ. Long Term Evolution යන්නේ අදහස ිගු කාලීන පරිනාමය යන්නයි. ඒ කියන්නේ පැරනි ක්‍රමවලින් අලුත් ක්‍රමයකට මාරු වීම හා දැනට ජංගම…",
    "poster": "image/2.jpg"
  }
]
